tayyibkara/UbiComp-Pic24-Lock/pic24fStarter-main/main.c
/* * Secret Key Project: Main Logic with Menu
 * Hardware: PIC24F Starter Kit
 * Logic: Standby -> Code Entry -> Menu -> (Lock OR Change Key)
 */

#include "PIC24FStarter.h"
#include <string.h>
#include <stdio.h> // Needed for sprintf
#include "DisplayUtils.h" 
#include "SystemUtils.h"  

// --- Configuration ---
// Button Mapping: 0=UP, 1=RIGHT, 2=DOWN, 3=LEFT, 4=CENTER
// NOTE: Removed 'const' so we can change it. Size increased to 8.
uint8_t secretCode[8] = {3, 0, 1, 2, 0, 0, 0, 0}; 
int codeLength = 4; // Replaced #define w  ith variable
int failedAttempts = 0; 
int lastDisplayedTime = -1;
int loggedInUserIndex = -1; // Stores the index (0-4) of the current user
// --- Prototypes ---
void ShowMenu(void);
void ChangePassword(void);
void HandleLockout(void);
void EnterSleepMode(void);
void UserAction_Add(int userId);
void UserAction_EditDelete(int userIndex);
int main(void) {
    // 1. Initialization
    INIT_CLOCK(); 
    CTMUInit(); 
    RGBMapColorPins();
    RGBTurnOnLED();
    ResetDevice();
    
// --- STEP 2: LOAD FROM FLASH ---
    LoadUsersFromFlash(); // <--- CHANGE THIS LINE
    // Calibration
    SetColor(BLACK); ClearDevice();
    SetColor(WHITE); DrawString(10, 20, "CALIBRATING");
    for(int i = 0; i < 250; i++) { ReadCTMU(); }
    SetColor(BLACK); ClearDevice(); 

    // App State Variables
    int currentStep = 0;
    int lastButtonState = -1;
    int isLocked = 1;
    uint8_t enteredCode[8] = {0}; 
    int isStandby = 1; 
    int timerActive = 0; 
    unsigned long timerStart = 0; 
    
    // Inactivity Variables
    unsigned long lastActivityTime = globalTimer; 
    int lastDisplayedTime = -1;

    // Blinking variables
    int blinkingSteps = 0; 
    unsigned long blinkStart = 0; 
    int isBlinking = 0; 

    // Initial Screen
    SetColor(WHITE); 
    DrawString(10, 20, "STANDBY");
    DrawString(10, 35, "PRESS CENTER");
    SetRGBs(255, 0, 0); 

    while(1) { 
        // 2. Read Sensors
        ReadCTMU(); 
        int currentButton = GetPressedButton();
        
        // ============================================
        // 1. GLOBAL INACTIVITY CHECK (Moved to TOP)
        // ============================================
        // We check this FIRST so it works even in Standby
        if (globalTimer - lastActivityTime >= 30000) {
            
            // CASE A: Already in Standby -> Go to SLEEP
            if (isStandby) {
                EnterSleepMode(); 
                
                // --- WAKE UP LOGIC ---
                // Code resumes here after waking up
                isStandby = 0;      // Go straight to "Enter Key"
                currentStep = 0;
                lastActivityTime = globalTimer;
                lastButtonState = 4; // Debounce Center button
                delay_ms(50);
                continue;
            }
            
            // CASE B: Active -> Go to STANDBY
            else {
                isStandby = 1;
                currentStep = 0;
                isBlinking = 0;
                timerActive = 0;
                lastActivityTime = globalTimer; // RESET TIMER for Stage 2
                
                SetColor(BLACK); ClearDevice(); SetColor(WHITE);
                DrawString(10, 20, "STANDBY");
                DrawString(10, 35, "PRESS CENTER");
                SetRGBs(255, 0, 0); 
                
                lastButtonState = currentButton;
                delay_ms(50);
                continue;
            }
        }
        
        // ============================================
        // 2. STANDBY MODE LOGIC
        // ============================================
        if (isStandby) {
            if (currentButton == 4 && lastButtonState == -1) { // Wake on CENTER
                isStandby = 0;
                currentStep = 0;
                lastActivityTime = globalTimer; 
                
                SetColor(BLACK); ClearDevice(); SetColor(WHITE);
                DrawString(10, 10, "ENTER KEY");
                SetRGBs(255, 0, 0); 
            }
            lastButtonState = currentButton;
            delay_ms(50);
            continue; // This 'continue' is now safe because we checked timer above
        }
        
        // ============================================
        // 3. KEY ENTRY MODE (Active)
        // ============================================
        if (timerActive) {
            unsigned long elapsedTime = globalTimer - timerStart;
            int secondsRemaining = 15 - (elapsedTime / 1000);
            
            if (secondsRemaining <= 0) {
                // Input Timeout
                timerActive = 0;
                currentStep = 0;
                isBlinking = 0;
                lastDisplayedTime = -1;
                
                SetColor(BLACK); ClearDevice(); SetColor(WHITE);
                DrawString(10, 15, "TIME OUT");
                delay_ms(2000); 
                
                SetColor(BLACK); ClearDevice(); SetColor(WHITE);
                DrawString(10, 10, "ENTER KEY");
                lastActivityTime = globalTimer; // Reset inactivity timer
                lastButtonState = currentButton;
                delay_ms(50);
                continue; 
            }
            
            if (secondsRemaining != lastDisplayedTime) {
                DisplayTimer(secondsRemaining);
                lastDisplayedTime = secondsRemaining;
            }
        }
        
        // Blink Logic
        if (isBlinking && blinkingSteps > 0) {
            unsigned long blinkElapsed = globalTimer - blinkStart;
            if (blinkElapsed >= 600) {
                isBlinking = 0;
                DisplayPasswordProgress(blinkingSteps);
            } else {
                if ((blinkElapsed / 300) % 2 == 0) DisplayPasswordProgress(blinkingSteps);
                else {
                    SetColor(BLACK);
                    for (int i = 0; i < 30; i++) for (int j = 0; j < 8; j++) PutPixel(10 + i, 30 + j);
                }
            }
        }

