tayyibkara/UbiComp-Pic24-Lock/pic24fStarter-main/main.c
        // ============================================
        // 4. BUTTON PRESS LOGIC
        // ============================================
        if (currentButton != -1 && lastButtonState == -1) {
            
            // Any button press resets the inactivity timer
            lastActivityTime = globalTimer; 
            
            if (currentStep == 0 && !timerActive) {
                timerActive = 1;
                timerStart = globalTimer;
            }
            
            SetRGBs(0, 0, 255); // Blue flash
            
            if (currentStep < codeLength) {
                enteredCode[currentStep] = currentButton;
                currentStep++; 
                DisplayPasswordProgress(currentStep);
                blinkingSteps = currentStep;
                isBlinking = 1;
                blinkStart = globalTimer;
            }
            
            // Check Code
            if (currentStep >= 4) { // Only check if at least 4 digits entered
                
                timerActive = 0; // Stop timer while checking
                int foundUserIndex = -1;

                // --- SCAN DATABASE ---
                for(int i = 0; i < MAX_USERS; i++) {
                    if(userDB[i].isActive) {
                        // 1. Check Length
                        if(currentStep != userDB[i].codeLength) continue;

                        // 2. Check Code
                        int match = 1;
                        for(int j = 0; j < currentStep; j++) {
                            if(enteredCode[j] != userDB[i].code[j]) { 
                                match = 0; 
                                break; 
                            }
                        }

                        if(match) {
                            foundUserIndex = i;
                            break; // Found a valid user! Stop scanning.
                        }
                    }
                }
                
                SetColor(BLACK); ClearDevice(); SetColor(WHITE);
                
                if (foundUserIndex != -1) {
                    // --- SUCCESS ---
                    loggedInUserIndex = foundUserIndex; // <--- SAVE THE USER ID HERE
                    
                    failedAttempts = 0;
                    
                    // Show specific user ID
                    char msg[16];
                    sprintf(msg, "USER %d", userDB[foundUserIndex].id);
                    DrawString(10, 10, "WELCOME:");
                    DrawString(10, 25, msg);
                    
                    SetRGBs(0, 255, 0); 
                    delay_ms(2000);
                    
                    // (Menu Logic would go here later)
                    // For now, just reset
                    ShowMenu();
                    isStandby = 1; 
                    lastActivityTime = globalTimer; 
                    SetColor(BLACK); ClearDevice(); SetColor(WHITE);
                    DrawString(10, 20, "STANDBY");
                    DrawString(10, 35, "PRESS CENTER");
                    SetRGBs(255, 0, 0); 
                    
                } else {
                    // --- FAILURE ---
                    // Only fail if we reached 8 digits OR user stopped typing (timeout)
                    // But for this simple test, if it didn't match any user, it fails.
                    DrawString(10, 15, "KEY WRONG");
                    SetRGBs(255, 0, 0); 
                    
                    failedAttempts++;
                    if (failedAttempts >= 3) {
                        HandleLockout(); 
                    } else {
                        delay_ms(2000); 
                    }
                    
                    SetColor(BLACK); ClearDevice(); SetColor(WHITE);
                    DrawString(10, 10, "ENTER KEY");
                    lastActivityTime = globalTimer;
                }
                currentStep = 0;
                isBlinking = 0;
            }
//            if (currentStep == codeLength) {
//                timerActive = 0;
//                
//                int isCorrect = 1;
//                for (int i = 0; i < codeLength; i++) {
//                    if (enteredCode[i] != secretCode[i]) {
//                        isCorrect = 0;
//                        break;
//                    }
//                }
//                
//                SetColor(BLACK); ClearDevice(); SetColor(WHITE);
//                
//                if (isCorrect) {
//                    failedAttempts = 0;
//                    DrawString(10, 20, "UNLOCKED");
//                    SetRGBs(0, 255, 0); 
//                    delay_ms(1000);
//                    
//                    ShowMenu(); // Enter Menu
//                    
//                    // Reset after Menu exit
//                    isStandby = 1; 
//                    lastActivityTime = globalTimer; // Reset timer for standby
//                    SetColor(BLACK); ClearDevice(); SetColor(WHITE);
//                    DrawString(10, 20, "STANDBY");
//                    DrawString(10, 35, "PRESS CENTER");
//                    SetRGBs(255, 0, 0); 
//                    
//                } else {
//                    DrawString(10, 15, "KEY WRONG");
//                    SetRGBs(255, 0, 0); 
//                    
//                    failedAttempts++;
//                    if (failedAttempts >= 3) {
//                        HandleLockout(); 
//                    } else {
//                        delay_ms(2000); 
//                    }
//                    
//                    SetColor(BLACK); ClearDevice(); SetColor(WHITE);
//                    DrawString(10, 10, "ENTER KEY");
//                    lastActivityTime = globalTimer;
//                }
//                currentStep = 0;
//                isBlinking = 0;
//            }
            delay_ms(250);
        }

        if (currentButton == -1 && lastButtonState != -1) {
            if (isLocked) SetRGBs(255, 0, 0); 
        }

        lastButtonState = currentButton;
        delay_ms(50); 
    }
    return 0;
}
// ============================================
// MENU LOGIC
// ============================================


//void ShowMenu(void) {
//    int selection = 0; 
//    int inMenu = 1;
//    int lastBtn = -1;
//    int needsRedraw = 1; 
//    
//    // Local Timer for Menu Timeout
//    unsigned long menuTimer = globalTimer;
//
//    while(GetPressedButton() != -1) ReadCTMU();
//
//    while(inMenu) {
//        ReadCTMU();
//        int btn = GetPressedButton();
//        
//        // --- TIMEOUT CHECK ---
//        if (globalTimer - menuTimer > 30000) {
//            return; // Exit to Main -> Main puts us in Standby
//        }
//        
//        if (needsRedraw) {
//            SetColor(BLACK); ClearDevice(); SetColor(WHITE);
//            DrawString(10, 5, "MAIN MENU");
//            if (selection == 0) DrawString(10, 25, "> LOCK SYSTEM");
//            else DrawString(10, 25, "  LOCK SYSTEM");
//            if (selection == 1) DrawString(10, 40, "> CHANGE KEY");
//            else DrawString(10, 40, "  CHANGE KEY");
//            needsRedraw = 0; 
//        }
//        
//        if (btn != -1 && btn != lastBtn) {
//            menuTimer = globalTimer; // Reset Timer on Input
//            
//            if (btn == 0 || btn == 2) { 
//                selection = !selection; 
//                needsRedraw = 1; 
//            } 
//            else if (btn == 4 || btn == 1) { 
//                if (selection == 0) inMenu = 0; 
//                else {
//                    ChangePassword(); 
//                    needsRedraw = 1; 
//                    menuTimer = globalTimer; // Reset when returning
//                }
//            }
//            delay_ms(150);
//        }
//        lastBtn = btn;
//        delay_ms(50);
//    }
//}
//

void ShowMenu(void) {
    int selection = 0; 
    int inMenu = 1;
    int lastBtn = -1;
    int needsRedraw = 1; 
    unsigned long menuTimer = globalTimer;

