tayyibkara/UbiComp-Pic24-Lock/pic24fStarter-main/main.c
    while(GetPressedButton() != -1) ReadCTMU();

    while(inMenu) {
        ReadCTMU();
        int btn = GetPressedButton();
        if (globalTimer - menuTimer > 30000) return; 
        
        if (needsRedraw) {
            SetColor(BLACK); ClearDevice(); SetColor(WHITE);
            DrawString(10, 5, "MAIN MENU");
            
            // OPTION 0: LOCK SYSTEM (Everyone sees this)
            if (selection == 0) DrawString(10, 25, "> LOCK SYSTEM");
            else DrawString(10, 25, "  LOCK SYSTEM");
            
            // OPTION 1: VARIES BY USER
            if (userDB[loggedInUserIndex].id == 1) {
                // ADMIN (User 1) SEES:
                if (selection == 1) DrawString(10, 40, "> MANAGE USERS");
                else DrawString(10, 40, "  MANAGE USERS");
            } else {
                // STANDARD USER SEES:
                if (selection == 1) DrawString(10, 40, "> CHANGE MY KEY");
                else DrawString(10, 40, "  CHANGE MY KEY");
            }
            needsRedraw = 0; 
        }
        
        if (btn != -1 && btn != lastBtn) {
            menuTimer = globalTimer; 
            if (btn == 0 || btn == 2) { 
                selection = !selection; 
                needsRedraw = 1; 
            } 
            else if (btn == 4 || btn == 1) { // Select
                if (selection == 0) {
                    inMenu = 0; // Lock System
                } 
                else {
                    // SELECTION 1 LOGIC
                    if (userDB[loggedInUserIndex].id == 1) {
                        // Admin -> Go to Full List
                        ManageUsers();
                    } else {
     // Standard User -> Go to Edit Logic
                        // We reuse "Add" because it handles entering a new code perfectly
                        UserAction_Add(userDB[loggedInUserIndex].id); 
                        
                        SaveUsersToFlash(); //
                    }
                    needsRedraw = 1; 
                    menuTimer = globalTimer; 
                }
            }
            delay_ms(150);
        }
        lastBtn = btn;
        delay_ms(50);
    }
}

void ChangePassword(void) {
    int newLen = 4;
    int choosing = 1;
    int lastBtn = -1;
    int needsRedraw = 1; 
    
    unsigned long subMenuTimer = globalTimer; // Local Timer
    
    while(GetPressedButton() != -1) ReadCTMU();
    
    // --- STEP 1: CHOOSE LENGTH ---
    while(choosing) {
        ReadCTMU();
        int btn = GetPressedButton();
        
        // Timeout Check
        if (globalTimer - subMenuTimer > 30000) return;
        
        if (needsRedraw) {
            SetColor(BLACK); ClearDevice(); SetColor(WHITE);
            DrawString(10, 5, "LENGTH?");
            if (newLen == 4) DrawString(10, 25, "> 4 DIGITS");
            else DrawString(10, 25, "  4 DIGITS");
            if (newLen == 8) DrawString(10, 40, "> 8 DIGITS");
            else DrawString(10, 40, "  8 DIGITS");
            needsRedraw = 0;
        }
        
        if (btn != -1 && btn != lastBtn) {
            subMenuTimer = globalTimer; // Reset Timer
            if (btn == 0 || btn == 2) { 
                newLen = (newLen == 4) ? 8 : 4;
                needsRedraw = 1; 
            }
            else if (btn == 4 || btn == 1) choosing = 0;
            delay_ms(150);
        }
        lastBtn = btn;
        delay_ms(50);
    }
    
    // --- STEP 2: ENTER NEW CODE ---
    int count = 0;
    uint8_t temp[8];
    subMenuTimer = globalTimer; // Reset Timer for Step 2
    
    SetColor(BLACK); ClearDevice(); SetColor(WHITE);
    DrawString(10, 10, "ENTER NEW:");
    
    while(GetPressedButton() != -1) ReadCTMU();
    lastBtn = -1;
    
    while(count < newLen) {
        ReadCTMU();
        int btn = GetPressedButton();
        
        // Timeout Check
        if (globalTimer - subMenuTimer > 30000) return;
        
        if (btn != -1 && btn != lastBtn) {
            subMenuTimer = globalTimer; // Reset Timer
            if (btn == 4) continue; 
            
            temp[count] = btn;
            count++;
            
            SetColor(WHITE);
            for(int i=0; i<count; i++) DrawChar(10 + (i*6), 30, '*');
            SetRGBs(0, 0, 255); delay_ms(100); SetRGBs(0, 255, 0);
        }
        lastBtn = btn;
    }
    
    // Save Logic (No changes here)
    codeLength = newLen;
    for(int i=0; i<8; i++) {
        if(i < newLen) secretCode[i] = temp[i];
        else secretCode[i] = 0;
    }
    SaveCodeToFlash(secretCode, codeLength);
    SetColor(BLACK); ClearDevice(); SetColor(WHITE);
    DrawString(10, 25, "SAVED!");
    delay_ms(1500);
}

void HandleLockout(void) {
    SetColor(BLACK); ClearDevice(); SetColor(WHITE);
    DrawString(5, 10, "SYSTEM LOCKED");
    DrawString(5, 25, "WAIT...");
    
    // 30 Second Countdown Loop
    for (int i = 30; i > 0; i--) {
        DisplayTimer(i); // Reuses your existing timer display
        
        // Alarm Effect: Flash Red/Blue
        SetRGBs(255, 0, 0); delay_ms(500);
        SetRGBs(0, 0, 255); delay_ms(500);
    }
    
    // Reset Logic
    failedAttempts = 0;
    SetRGBs(255, 0, 0); // Back to solid Red
    
    // Restore Screen
    SetColor(BLACK); ClearDevice(); SetColor(WHITE);
}
// Interrupt Service Routine for Timer 1
// This is required to wake the CPU from "Idle" mode
void __attribute__((interrupt, no_auto_psv)) _T1Interrupt(void) {
    IFS0bits.T1IF = 0; // Clear the interrupt flag
}

void EnterSleepMode(void) {
    // 1. Turn OFF High Power Components
    SetColor(BLACK); ClearDevice(); // OLED Off
    SetRGBs(0,0,0);                 // LEDs Off
    
    // 2. Configure Timer 1 as our "Wake-up Alarm"
    // We want it to interrupt every ~250ms
    T1CON = 0;              // Stop Timer
    TMR1 = 0;               // Clear Count
    T1CONbits.TCKPS = 0b11; // 1:256 Prescale
    PR1 = 0x4000;           // ~260ms Wakeup Interval
    
    IFS0bits.T1IF = 0;      // Clear Flag
    IEC0bits.T1IE = 1;      // Enable Interrupts (Crucial for Idle wake-up)
    T1CONbits.TON = 1;      // Start Timer
    
    // 3. Enter Low Power Loop
    while(1) {
        // [REAL POWER SAVE] 
        // This instruction stops the CPU clock!
        // The code HALTS here until Timer 1 fires an interrupt (every 250ms).
        __builtin_pwrsav(1); // 1 = Idle Mode
        
