tayyibkara/UbiComp-Pic24-Lock/pic24fStarter-main/main.c
        // --- CPU WAKES UP HERE ---
        // (ISR has run and cleared the flag)
        
        // Check for User Input
        ReadCTMU(); 
        
        // If Center Button (4) is pressed, fully wake up
        if (GetPressedButton() == 4) {
            break; 
        }
    }
    
    // 4. Cleanup & Restore
    T1CONbits.TON = 0;      // Stop Timer
    IEC0bits.T1IE = 0;      // Disable Interrupts (So delay_ms works again)
    
    // Restore Screen
    SetColor(BLACK); ClearDevice(); SetColor(WHITE);
    DrawString(10, 10, "ENTER KEY");
    SetRGBs(255, 0, 0);     // Red LED
}


void ManageUsers(void) {
    int selectedUser = 0; // Index 0 to 4 (User 1 to 5)
    int inSubMenu = 1;
    int lastBtn = -1;
    int needsRedraw = 1;
    unsigned long subTimer = globalTimer;
    char buffer[20];

    while(GetPressedButton() != -1) ReadCTMU();

    while(inSubMenu) {
        ReadCTMU();
        int btn = GetPressedButton();

        // Timeout
        if (globalTimer - subTimer > 30000) return;

        if (needsRedraw) {
            SetColor(BLACK); ClearDevice(); SetColor(WHITE);
            DrawString(10, 5, "USER LIST");

            // --- FIX: CALCULATE ID DYNAMICALLY ---
            // Use (selectedUser + 1) instead of .id to ensure it's always 1-5
            sprintf(buffer, "< USER %02d >", selectedUser + 1); 
            DrawString(10, 25, buffer);

            if (userDB[selectedUser].isActive) {
                DrawString(10, 40, "STATUS: ACTIVE");
            } else {
                DrawString(10, 40, "STATUS: EMPTY");
            }

            needsRedraw = 0;
        }

        if (btn != -1 && btn != lastBtn) {
            subTimer = globalTimer;

            if (btn == 0) { // UP -> Next
                selectedUser++;
                if (selectedUser >= MAX_USERS) selectedUser = 0;
                needsRedraw = 1;
            } 
            else if (btn == 2) { // DOWN -> Prev
                selectedUser--;
                if (selectedUser < 0) selectedUser = MAX_USERS - 1;
                needsRedraw = 1;
            }
            else if (btn == 3) { // LEFT -> Back
                inSubMenu = 0;
            }
            else if (btn == 4) { // CENTER -> Select User
                // Check if Empty or Active
                if (userDB[selectedUser].isActive) {
                    // Active -> Go to Edit/Delete
                    UserAction_EditDelete(selectedUser);
                } else {
                    // Empty -> Go to Add New User
                    // FIX: Pass (selectedUser + 1) as the ID
                    UserAction_Add(selectedUser + 1); 
                }
                needsRedraw = 1; // Redraw list when coming back
                SaveUsersToFlash(); // Save any changes immediately
            }
            
            delay_ms(150);
        }
        lastBtn = btn;
        delay_ms(50);
    }
}
// --- LOGIC FOR ADDING A NEW USER ---
// Used for both creating new users and editing existing ones
void UserAction_Add(int userId) {
    int newLen = 4;
    int choosing = 1;
    int lastBtn = -1;
    int needsRedraw = 1; 
    
    // 1. Choose Length
    while(GetPressedButton() != -1) ReadCTMU();
    
    while(choosing) {
        ReadCTMU();
        int btn = GetPressedButton();
        
        if (needsRedraw) {
            SetColor(BLACK); ClearDevice(); SetColor(WHITE);
            char title[20];
            sprintf(title, "NEW USER %02d", userId);
            DrawString(10, 5, title);
            
            if (newLen == 4) DrawString(10, 25, "> 4 DIGITS");
            else DrawString(10, 25, "  4 DIGITS");
            
            if (newLen == 8) DrawString(10, 40, "> 8 DIGITS");
            else DrawString(10, 40, "  8 DIGITS");
            needsRedraw = 0;
        }
        
        if (btn != -1 && btn != lastBtn) {
            if (btn == 0 || btn == 2) { 
                newLen = (newLen == 4) ? 8 : 4; 
                needsRedraw = 1; 
            }
            else if (btn == 4 || btn == 1) choosing = 0;
            delay_ms(150);
        }
        lastBtn = btn;
        delay_ms(50);
    }
    
    // 2. Enter Code
    int count = 0;
    uint8_t temp[8];
    SetColor(BLACK); ClearDevice(); SetColor(WHITE);
    DrawString(10, 10, "ENTER CODE:");
    
    while(GetPressedButton() != -1) ReadCTMU();
    lastBtn = -1;
    
    while(count < newLen) {
        ReadCTMU();
        int btn = GetPressedButton();
        if (btn != -1 && btn != lastBtn) {
            if (btn == 4) continue; // Skip Center
            
            temp[count] = btn;
            count++;
            
            SetColor(WHITE);
            for(int i=0; i<count; i++) DrawChar(10 + (i*6), 30, '*');
            SetRGBs(0, 0, 255); delay_ms(100); SetRGBs(0, 255, 0);
        }
        lastBtn = btn;
    }
    
    // 3. Save to RAM (Main loop saves to Flash later)
    int idx = userId - 1; // ID 1 is Index 0
    userDB[idx].id = userId; // Ensure ID is set correctly
    userDB[idx].isActive = 1;
    userDB[idx].codeLength = newLen;
    for(int i=0; i<8; i++) userDB[idx].code[i] = temp[i];
    
    SetColor(BLACK); ClearDevice(); SetColor(WHITE);
    DrawString(10, 25, "USER ADDED!");
    delay_ms(1500);
}

// --- LOGIC FOR EDITING (CHANGE PASS) OR DELETING ---
void UserAction_EditDelete(int userIndex) {
    int selection = 0; // 0=EDIT, 1=DELETE
    int choosing = 1;
    int lastBtn = -1;
    int needsRedraw = 1;
    
    while(GetPressedButton() != -1) ReadCTMU();
    
    while(choosing) {
        ReadCTMU();
        int btn = GetPressedButton();
        
        if (needsRedraw) {
            SetColor(BLACK); ClearDevice(); SetColor(WHITE);
            char title[20];
            
            // FIX: Use (userIndex + 1) to calculate ID
            sprintf(title, "USER %02d", userIndex + 1); 
            DrawString(10, 5, title);
            
            if (selection == 0) DrawString(10, 25, "> EDIT KEY");
            else DrawString(10, 25, "  EDIT KEY");
            
            if (selection == 1) DrawString(10, 40, "> DELETE USER");
            else DrawString(10, 40, "  DELETE USER");
            needsRedraw = 0;
        }
        
        if (btn != -1 && btn != lastBtn) {
            if (btn == 0 || btn == 2) { // Up/Down
                selection = !selection; 
                needsRedraw = 1; 
            }
            else if (btn == 4 || btn == 1) { // Select
                if (selection == 0) {
                    // EDIT -> Call Add logic to overwrite
                    // FIX: Pass correct ID
                    UserAction_Add(userIndex + 1); 
                } else {
                    // DELETE -> Mark as empty
                    userDB[userIndex].isActive = 0;
                    SetColor(BLACK); ClearDevice(); SetColor(WHITE);
                    DrawString(10, 25, "DELETED!");
                    delay_ms(1500);
                }
                choosing = 0;
            }
            else if (btn == 3) choosing = 0; // Left = Back
            delay_ms(150);
        }
        lastBtn = btn;
        delay_ms(50);
    }
}